ab-tests/sending.html/ab_multithreading_secure_c100.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /sending.html
Document Length:        124 bytes

Concurrency Level:      10
Time taken for tests:   141.600 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      261000 bytes
HTML transferred:       124000 bytes
Requests per second:    7.06 [#/sec] (mean)
Time per request:       1416.003 [ms] (mean)
Time per request:       141.600 [ms] (mean, across all concurrent requests)
Transfer rate:          1.80 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      1       2
Processing:    13 1397 1074.7   1257    5811
Waiting:        4 1359 1054.1   1199    5810
Total:         15 1398 1074.7   1258    5811

Percentage of the requests served within a certain time (ms)
  50%   1258
  66%   1645
  75%   1993
  80%   2212
  90%   2810
  95%   3436
  98%   4406
  99%   4989
 100%   5811 (longest request)